---
kind: method
id: M:Autodesk.Revit.DB.RevitLinkGraphicsSettings.Dispose
source: html/6e7e1e63-705c-fd90-7364-26eccb19d111.htm
---
# Autodesk.Revit.DB.RevitLinkGraphicsSettings.Dispose Method

Releases all resources used by the RevitLinkGraphicsSettings

## Syntax (C#)
```csharp
public void Dispose()
```